app/controllers/search_api_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%davin%')  ORDER BY created_at DESC
---
  def search_page
    if params[:search]
      @products = Product.search(params[:search]).order("created_at DESC")